Documents/АктСписанияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>АктСписанияТМЦ</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПосле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктСписанияТМЦ/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Предопределенные
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Проведен Тогда
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОбновитьИтоги();
КонецПроцедуры

// Команды
&НаСервере
Процедура КомандаТоварыЗаполнитьНаСервере()
	Момент = ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект);
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТовары(Объект.Товары, Объект.Склад, Перечисления.ТипыТовара.Товар, Момент);
КонецПроцедуры

&НаКлиенте
Процедура КомандаТоварыЗаполнить(Команда)
	КомандаТоварыЗаполнитьНаСервере();
	
	ОбновитьИтоги();
КонецПроцедуры

&НаСервере
Процедура КомандаТоварыОбновитьНаСервере()
	Момент = ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект);
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТовары(Объект.Товары, Объект.Склад, Перечисления.ТипыТовара.Товар, Момент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаТоварыОбновить(Команда)
	КомандаТоварыОбновитьНаСервере();
	
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура КомандаТоварыУдалитьПС(Команда)
	ПустыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Количество", 0)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Товары.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

// Товары
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	Момент = ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект);
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.ЦенаБазовая = РаботаСТоварами.Цена(ТекСтрока.Товар, "ЦенаБазовая", Момент);
	ТекСтрока.ОстатокДо = РаботаСТоварами.Остаток(Объект.Склад, ТекСтрока.Товар, Момент);
	ТекСтрока.СтавкаНДС = ИсторияРеквизитов.Получить(ТекСтрока.Товар, "СтавкаНДС", Момент, ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС"));
	
	ТоварыПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТоварыПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаБазоваяПриИзменении(Элемент)
	ТоварыПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТоварыПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаСНДСПриИзменении(Элемент)
	ТоварыПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСтроку(ИдентификаторСтроки)
	Строка = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Элементы.Товары.ТекущийЭлемент <> Неопределено Тогда
		СтавкаНДС = ОбщийМодульСервер.ПолучитьЗначениеРеквизита(Строка.СтавкаНДС, "Ставка");
		
		Если Элементы.Товары.ТекущийЭлемент.Имя = "ТоварыСНДС" Тогда
			Строка.ЦенаБазовая = АрифметическиеФункции.ВычитатьНаценку(Строка.ЦенаСНДС, СтавкаНДС);
		Иначе
			Строка.ЦенаСНДС = АрифметическиеФункции.ДобавитьНаценку(Строка.ЦенаБазовая, СтавкаНДС);
		КонецЕсли;
		
		Строка.СуммаБазовая = Строка.ЦенаБазовая * Строка.Количество;
		Строка.СуммаНДС = АрифметическиеФункции.РассчитатьНаценку(Строка.СуммаБазовая, СтавкаНДС);
		Строка.СуммаСНДС = Строка.ЦенаСНДС * Строка.Количество;
		
		Строка.Объем = Строка.Количество * ОбщийМодульСервер.ПолучитьЗначениеРеквизита(Строка.Товар, "Объем", 0);
		Строка.Вес = Строка.Количество * ОбщийМодульСервер.ПолучитьЗначениеРеквизита(Строка.Товар, "Вес", 0);
	КонецЕсли;
КонецПроцедуры

// Вспомагательные
Процедура ОбновитьИтоги()
	Количество = Объект.Товары.Итог("Количество");
	Объем = Объект.Товары.Итог("Объем");
	Вес = Объект.Товары.Итог("Вес");
	Сумма = Объект.Товары.Итог("СуммаБазовая");
	СуммаВсего = Объект.Товары.Итог("СуммаБазовая");
КонецПроцедуры
